IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT IFILE ASSIGN TO 'input.txt'
      ORGANIZATION IS LINE SEQUENTIAL.            

DATA DIVISION.
   FILE SECTION.
   FD IFILE.
   01 INPUT-FILE.
      05 DEPTH PIC 9(5).

   WORKING-STORAGE SECTION.
   01 WS-FILE.
      05 WS-DEPTH PIC 9(5).
   05 WS-PREV PIC 9(5).
   05 WS-COUNT PIC 9(4).
   01 WS-EOF PIC A(1). 

PROCEDURE DIVISION.
   OPEN INPUT IFILE.
      PERFORM UNTIL WS-EOF='Y'
         READ IFILE INTO WS-DEPTH
            AT END MOVE 'Y' TO WS-EOF
            NOT AT END
            IF WS-PREV IS NOT ZERO AND WS-DEPTH > WS-PREV THEN
               ADD 1 TO WS-COUNT
            END-IF
            MOVE WS-DEPTH TO WS-PREV
         END-READ
      END-PERFORM.
   CLOSE IFILE.
   DISPLAY WS-COUNT
STOP RUN.
