IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

ENVIRONMENT DIVISION.
   INPUT-OUTPUT SECTION.
      FILE-CONTROL.
      SELECT IFILE ASSIGN TO 'input.txt'
      ORGANIZATION IS LINE SEQUENTIAL.            

DATA DIVISION.
   FILE SECTION.
   FD IFILE.
   01 INPUT-FILE.
      05 DEPTH PIC 9(5).

   WORKING-STORAGE SECTION.
   01 WS-FILE.
      05 WS-DEPTH PIC 9(5).
   05 WS-PREV0 PIC 9(5).
   05 WS-PREV1 PIC 9(5).
   05 WS-PREV2 PIC 9(5).
   05 WS-WINDOW0 PIC 9(6).
   05 WS-WINDOW1 PIC 9(6).
   05 WS-COUNT PIC 9(4).
   01 WS-EOF PIC A(1). 

PROCEDURE DIVISION.
   OPEN INPUT IFILE.
      PERFORM UNTIL WS-EOF='Y'
         READ IFILE INTO WS-DEPTH
            AT END MOVE 'Y' TO WS-EOF
            NOT AT END
            ADD WS-DEPTH WS-PREV0 TO WS-PREV1 GIVING WS-WINDOW0
            ADD WS-PREV0 WS-PREV1 TO WS-PREV2 GIVING WS-WINDOW1
            IF WS-PREV2 IS NOT ZERO AND WS-WINDOW0 > WS-WINDOW1 THEN
               ADD 1 TO WS-COUNT
            END-IF
            MOVE WS-PREV1 TO WS-PREV2
            MOVE WS-PREV0 TO WS-PREV1
            MOVE WS-DEPTH TO WS-PREV0
         END-READ
      END-PERFORM.
   CLOSE IFILE.
   DISPLAY WS-COUNT
STOP RUN.
